# SizePrefix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSettings..::..SizePrefix Property
ConduitSettings Class See Also
---
The conduit size prefix string.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string SizePrefix { get; set; }
```

Visual Basic
---
```text
Public Property SizePrefix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SizePrefix {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace